kc/template_flowfield/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/bgMesh"
dimensions      [0 2 -2 0 0 0 0];	// Mass; Lenght; Time; Temperature; Quantity (mol);Current; Candela;

internalField   uniform 0;

boundaryField
{
    front
    {
        type            fixedValue;
        value 		    uniform $dp;
    }

    back
    {
        type            fixedValue;
        value 		    uniform 0;
    }


    top
    {
        type            symmetry;
    }

    bottom
    {
        type            symmetry;
    }

    right
    {
        type            symmetry;
    }

    left
    {
        type            symmetry;
    }
    
    walls
    {
        type           zeroGradient;
    }
}

// ************************************************************************* //
